public/math/calculus-fundamentals.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Calculus Fundamentals</title>
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' href='./styles/simple.css' />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Calculus Fundamentals</h1>

<div id="outline-container-org0b99da9" class="outline-2">
<h2 id="org0b99da9">Calculus Fundamentals</h2>
<div class="outline-text-2" id="text-org0b99da9">
</div>
<div id="outline-container-org27b1815" class="outline-3">
<h3 id="org27b1815">Introduction to Calculus</h3>
<div class="outline-text-3" id="text-org27b1815">
<ul class="org-ul">
<li>Understanding the basics of calculus and its role in mathematics and science</li>
<li>Applications of calculus in various fields</li>
</ul>
</div>
</div>

<div id="outline-container-org44dde63" class="outline-3">
<h3 id="org44dde63">Limits and Continuity</h3>
<div class="outline-text-3" id="text-org44dde63">
<ul class="org-ul">
<li>Defining limits and their properties</li>
<li>Determining continuity of functions</li>
</ul>
</div>
</div>

<div id="outline-container-org988d6af" class="outline-3">
<h3 id="org988d6af">Differentiation</h3>
<div class="outline-text-3" id="text-org988d6af">
<ul class="org-ul">
<li>Calculating derivatives of functions</li>
<li>Rules of differentiation (product rule, chain rule, etc.)</li>
</ul>
</div>
</div>

<div id="outline-container-org8cea1f5" class="outline-3">
<h3 id="org8cea1f5">Applications of Differentiation</h3>
<div class="outline-text-3" id="text-org8cea1f5">
<ul class="org-ul">
<li>Using derivatives to solve problems in optimization, rates of change, and curve sketching</li>
<li>Applications in physics, economics, and engineering</li>
</ul>
</div>
</div>

<div id="outline-container-orgdcac2fa" class="outline-3">
<h3 id="orgdcac2fa">Integration</h3>
<div class="outline-text-3" id="text-orgdcac2fa">
<ul class="org-ul">
<li>Understanding the concept of integration and antiderivatives</li>
<li>Techniques of integration (substitution, integration by parts, etc.)</li>
</ul>
</div>
</div>

<div id="outline-container-orga5ba7f0" class="outline-3">
<h3 id="orga5ba7f0">Applications of Integration</h3>
<div class="outline-text-3" id="text-orga5ba7f0">
<ul class="org-ul">
<li>Solving problems involving area, volume, and accumulated change</li>
<li>Applications in probability, physics, and engineering</li>
</ul>
</div>
</div>

<div id="outline-container-org8694017" class="outline-3">
<h3 id="org8694017">Multivariable Calculus</h3>
<div class="outline-text-3" id="text-org8694017">
<ul class="org-ul">
<li>Extending calculus concepts to functions of multiple variables</li>
<li>Partial derivatives, gradients, and optimization in multivariable functions</li>
</ul>
</div>
</div>

<div id="outline-container-orgc416979" class="outline-3">
<h3 id="orgc416979">Vector Calculus</h3>
<div class="outline-text-3" id="text-orgc416979">
<ul class="org-ul">
<li>Introduction to vector calculus and its applications in physics and engineering</li>
<li>Topics like line integrals, surface integrals, and the divergence theorem</li>
</ul>
</div>
</div>

<div id="outline-container-orgbbb0e3d" class="outline-3">
<h3 id="orgbbb0e3d">Differential Equations</h3>
<div class="outline-text-3" id="text-orgbbb0e3d">
<ul class="org-ul">
<li>Solving ordinary differential equations (ODEs) and understanding their solutions</li>
<li>Applications of differential equations in modeling dynamic systems</li>
</ul>
</div>
</div>

<div id="outline-container-orgb1f5ae0" class="outline-3">
<h3 id="orgb1f5ae0">Calculus in Machine Learning</h3>
<div class="outline-text-3" id="text-orgb1f5ae0">
<ul class="org-ul">
<li>How calculus concepts underlie various machine learning algorithms</li>
<li>Examples from gradient descent, optimization, and neural networks</li>
</ul>
</div>
</div>

<div id="outline-container-orga93c993" class="outline-3">
<h3 id="orga93c993">Further Reading and Resources</h3>
<div class="outline-text-3" id="text-orga93c993">
<ul class="org-ul">
<li>Recommended books, courses, and online resources for delving deeper into calculus</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.1 (<a href="https://orgmode.org">Org</a> mode 9.6.6)</p>
</div>
</body>
</html>